[
    {
        "lessonID": 1,
        "language": "Spanish",
        "difficultyLevel": "Basic",
        "content": "This lesson is an introduction to the language of Spanish. You will learn basic greetings, such as 'Hola' (Hello) and 'Adiós' (Goodbye). Additionally, we'll cover essential phrases like 'Por favor' (Please) and 'Gracias' (Thank you). Understanding these basics will help you in daily conversations and set a strong foundation for your Spanish learning journey.",
        "duration": "Short",
        "feedbackList": [
            "This is easy!",
            "Too easy!"
        ]
    },
    {
        "lessonID": 2,
        "language": "Spanish",
        "difficultyLevel": "Basic",
        "content": "This lesson is an introduction to the basics of grammar in Spanish. You will learn about nouns and adjectives, focusing on gender (masculine and feminine) and number (singular and plural). For example, 'el libro' (the book) is masculine, while 'la mesa' (the table) is feminine. We will also explore how adjectives agree with nouns in gender and number, such as 'libro interesante' (interesting book) and 'mesas interesantes' (interesting tables).",
        "duration": "Medium",
        "feedbackList": [
            "Pretty helpful lesson!",
            "Great difficulty increase!"
        ]
    },
    {
        "lessonID": 11,
        "language": "Spanish",
        "difficultyLevel": "Advanced",
        "content": "This lesson is a continuation of more advanced Spanish grammar concepts. We will dive into the subjunctive mood, which expresses desires, doubts, and hypothetical situations. For instance, you will learn phrases like 'Espero que vengas' (I hope that you come) and 'Dudo que él tenga razón' (I doubt that he is right). Additionally, we will cover the use of the conditional tense, allowing you to express actions that would happen under certain conditions, such as 'Si tuviera dinero, viajaría' (If I had money, I would travel).",
        "duration": "Long",
        "feedbackList": [
            "The difficulty spike might be a bit much, no?",
            "Wow this is difficult!"
        ]
    }
]